abandon
abase
abash
abate
abbreviate
abdicate
abduct
abet
abhor
abide
abjure
abolish
abominate
abort
abound
abrade
abridge
abrogate
abscond
absent
absolve
absorb
abstain
abstract
abuse
abut
accede
accelerate
accent
accentuate
accept
access
acclaim
acclimate
acclimatize
accommodate
accompany
accomplish
accord
accost
accredit
accrue
accumulate
accuse
ache
achieve
acidify
acknowledge
acquiesce
acquire
acquit
act
activate
actuate
adapt
add
addict
addle
address
adduce
adjoin
adjourn
adjudge
adjudicate
adjure
adjust
administer
admire
admit
admix
admonish
adopt
adore
adorn
adulterate
adumbrate
advance
adventure
advertise
advertize
advise
advocate
aerate
affect
affiance
affirm
affix
afflict
afford
afforest
affranchise
affront
age
agglomerate
agglutinate
aggrandize
aggravate
aggregate
aggrieve
agitate
agree
aid
ail
aim
air
alarm
alert
alienate
alight
align
alkylate
allay
allege
alleviate
allocate
allot
allow
alloy
allure
alter
alternate
amalgamate
amass
amaze
amble
ambush
ameliorate
amend
amortize
amplify
amputate
amuse
anaesthetize
analyse
analyze
anathematize
anchor
anesthetize
anger
angle
anglicize
animadvert
animate
anneal
annex
annihilate
annotate
announce
annoy
annualize
annul
annunciate
anoint
answer
antagonize
antedate
anticipate
ape
apologize
apostrophize
appal
apparel
appeal
appear
appease
append
applaud
applique
apply
appoint
apportion
appraise
appreciate
apprehend
apprentice
approach
appropriate
approve
approximate
aquaplane
arbitrate
arch
argue
arise
arm
arouse
arraign
arrange
array
arrest
arrive
article
articulate
ascend
ascertain
ask
asperse
asphalt
asphyxiate
aspirate
aspire
assail
assassinate
assault
assay
assemble
assent
assert
assess
asseverate
assign
assimilate
assist
associate
assuage
assume
assure
astonish
astound
atomize
atrophy
attach
attack
attain
attempt
attend
attenuate
attest
attire
attitudinize
attract
auction
audit
audition
augment
augur
authenticate
author
authorize
autograph
automate
avail
avenge
aver
average
avert
avoid
avow
await
awaken
award
awe
ax
axe
baa
babble
baby
babysit
back
backbite
backdate
backfire
backpedal
backslide
backspace
badger
baffle
bag
bail
bait
bake
balance
bale
balk
ball
ballast
balloon
bamboozle
ban
band
bandage
bandy
bang
banish
bank
bankrupt
banquet
banter
baptize
bar
barbarize
barbecue
bare
bargain
barge
bark
barnstorm
barrack
barricade
barter
bask
bastardize
baste
bastinado
bat
bate
bathe
batten
batter
battle
baulk
bawl
bay
bayonet
beach
beam
bear
beard
beat
beatify
beautify
beaver
beckon
become
bed
bedevil
beetle
befall
befit
befoul
befriend
beg
beget
beggar
begin
begrudge
beguile
behave
behead
behold
belabor
belabour
belay
belch
beleaguer
belie
believe
belittle
bell
bellow
belly
bellyache
bellyland
bellylaugh
belong
belt
bemoan
bend
benefit
bequeath
berate
bereave
berth
beseech
beset
besiege
besmear
besmirch
bespeak
best
bestir
bestow
bestride
bet
betake
bethink
betide
betoken
betray
betroth
better
bevel
bewail
beware
bewilder
bewitch
bias
bib
bicker
bicycle
bid
bide
biff
bifurcate
bike
bilk
bill
billet
billow
bind
birch
birdie
bisect
bitch
bite
bivouac
blab
blabber
black
blackball
blacken
blackguard
blackleg
blacklist
blackmail
blame
blanch
blanket
blare
blaspheme
blast
blather
blaze
blazon
bleach
bleat
bleed
bleep
blemish
blench
blend
bless
blether
blight
blind
blindfold
blink
blister
blitz
block
blockade
blood
bloody
bloom
blossom
blot
blow
blubber
bludgeon
blue
bluff
blunder
blunt
blur
blurt
blush
bluster
board
boast
boat
bob
bode
bog
boggle
boil
bolster
bolt
bomb
bond
bone
boo
boob
book
boom
boost
boot
bootleg
booze
border
bore
borrow
botanize
botch
bother
bottle
bottom
bounce
bound
bow
bowdlerize
bowl
box
boycott
brace
bracket
brag
braid
brain
brainwash
braise
brake
brand
brandish
brave
brawl
bray
braze
brazen
breach
break
breakfast
breast
breastfeed
breathe
breed
breeze
brew
bribe
brick
bridge
bridle
brief
brighten
brim
bring
bristle
broach
broadcast
broaden
brocade
broil
broker
bronze
brood
brook
browbeat
brown
browse
bruise
bruit
brush
brutalize
bubble
buck
bucket
buckle
bud
budge
budget
buff
buffet
bug
bugger
build
bulge
bulk
bulldoze
bullshit
bully
bum
bumble
bump
bunch
bundle
bung
bungle
bunk
bunker
buoy
burble
burden
burgeon
burgle
burke
burlesque
burn
burnish
burp
burrow
burst
bury
bus
bust
bustle
butcher
butt
butter
button
buttonhole
buttress
buy
buzz
bypass
cable
cache
cackle
cadge
cage
calcify
calcine
calculate
calender
calk
call
calm
calumniate
calve
camber
camouflage
can
canalize
cancel
candy
cane
canker
cannibalize
canonize
cant
canter
canvass
cap
caparison
caper
capitalize
capitulate
capsize
captain
captivate
capture
carbonize
card
care
careen
caress
caricature
carol
carouse
carpet
carry
cart
cartoon
carve
cascade
case
cash
cashier
cast
castigate
castle
castrate
catalogue
catapult
catcall
catch
categorize
cater
caterwaul
caulk
cause
cauterize
caution
cave
cavil
cavort
caw
cease
cede
celebrate
cement
censor
censure
center
centralize
centre
certificate
certify
chaff
chagrin
chair
chalk
challenge
champ
champion
change
channel
chant
chap
chaperon
char
characterize
charge
charm
chart
charter
chase
chasten
chastise
chat
chatter
chaw
cheapen
cheat
check
checker
checkmate
cheep
cheer
chequer
cherish
chew
chide
chill
chime
chink
chip
chirp
chirrup
chisel
chivvy
chivy
chlorinate
choke
choose
chop
chortle
chorus
christen
chronicle
chuck
chug
churn
cipher
circle
circularize
circulate
circumcise
circumnavigate
circumscribe
circumvent
cite
civilize
clack
claim
clam
clamber
clamor
clamour
clang
clank
clap
clarify
clash
clasp
classify
clean
cleanse
clear
cleave
clench
clew
click
climax
climb
clinch
clink
clip
clobber
clock
clog
close
clot
clothe
cloud
clout
clown
club
cluck
clump
clunk
cluster
clutch
clutter
coach
coagulate
coal
coalesce
coarsen
coast
coat
cobble
cock
coddle
code
codevelop
codify
coerce
coexist
cofinance
cogitate
cohabit
cohere
coil
coin
coincide
coke
collapse
collar
collate
collect
collectivize
collide
colonize
color
colour
comb
combat
combine
combust
come
comfort
command
commandeer
commemorate
commence
commend
comment
commercialize
commingle
commiserate
commission
commit
commune
communicate
commute
compact
compare
compartmentalize
compass
compel
compensate
compete
compile
complain
complement
complete
complicate
compliment
comply
comport
compose
compost
compound
comprehend
compress
comprise
compromise
compute
computerize
con
conceal
concede
conceive
concentrate
concern
concert
conciliate
conclude
concoct
concur
condemn
condense
condition
condone
conduct
cone
confab
confabulate
confederate
confer
confess
configure
confine
confirm
confiscate
conflict
confound
confront
confuse
confute
congeal
conglomerate
congratulate
congregate
conjoin
conjugate
conjure
connect
connote
conquer
conscript
consecrate
conserve
consider
console
consolidate
conspire
constipate
constitute
constitutionalize
constrain
constrict
construct
consult
consume
consummate
contact
contain
contaminate
contemn
contemplate
contend
content
contest
continue
contort
contour
contract
contradict
contrast
contravene
contribute
contrive
control
controvert
contuse
convalesce
convene
converge
converse
convert
convey
convict
convince
convoke
convulse
coo
cook
cool
cooperate
coordinate
cop
cope
copper
copulate
copy
copyright
cord
cordon
core
cork
corn
corner
corral
correct
correlate
correspond
corroborate
corrode
corrugate
corrupt
cosponsor
cosset
cost
cotton
cough
counsel
count
countenance
counter
counteract
counterattack
counterbalance
counterfeit
countermand
countermine
counterplot
counterpoise
countersign
countertrade
countervail
couple
course
court
cover
covet
cow
cower
cox
cozen
crab
crack
crackle
cradle
craft
cram
cramp
crane
crank
crap
crash
crate
crave
crawl
crayon
creak
cream
crease
create
credit
cremate
crest
crew
crick
crimp
crimson
cringe
crinkle
cripple
crisp
crisscross
criticise
criticize
croak
crochet
crook
croon
crop
cross
crossbreed
crosscheck
crouch
crow
crowd
crown
crucify
cruise
crumble
crumple
crunch
crush
crust
cry
crystallize
cube
cuckold
cuddle
cudgel
cuff
cull
culminate
cultivate
cup
curb
curdle
cure
curl
curry
curse
curtail
curtsey
curtsy
curve
cushion
customize
cut
cyclostyle
cypher
dab
dabble
dally
dam
damage
damascene
damn
damp
dampen
dance
dandle
dangle
dapple
dare
darken
darn
dart
dash
date
daunt
dawdle
dawn
daydream
daze
dazzle
deaden
deafen
deal
debag
debar
debark
debase
debate
debauch
debilitate
debit
debouch
debrief
debug
debunk
decamp
decant
decapitate
decarbonize
decay
decease
deceive
decelerate
decentralize
decide
decimalize
decimate
decipher
deck
declaim
declare
declassify
decline
decode
decolonize
decompose
decompress
decontaminate
decontrol
decorate
decoy
decrease
decree
decry
dedicate
deduce
deduct
deepen
deface
defame
default
defeat
defecate
defect
defend
defer
defile
define
deflate
deflect
deflower
defoliate
deforest
deform
defraud
defray
defrock
defrost
defuse
defy
degauss
degenerate
degrade
dehorn
dehumanize
dehydrate
deify
deign
delay
delegate
delete
deliberate
delight
delimit
delineate
deliver
delouse
delude
deluge
delve
demagnetize
demand
demarcate
demean
demilitarize
demob
demobilize
democratize
demolish
demonetize
demonstrate
demoralize
demote
demur
denationalize
denigrate
denominate
denote
denounce
dent
denude
deny
deodorize
depart
depend
depict
deplane
deplete
deplore
deploy
depopulate
deport
depose
deposit
deprave
deprecate
depreciate
depress
deprive
depute
deputize
derail
derange
derate
deregulate
derequisition
derestrict
deride
derive
derogate
desalinate
desalinize
desalt
descale
descant
descend
describe
descry
desecrate
desegregate
desensitize
desert
deserve
desiccate
design
designate
desire
desist
desolate
despair
despatch
despise
despoil
destabilize
destroy
detach
detail
detain
detect
deter
deteriorate
determine
detest
dethrone
detonate
detour
detract
detrain
detribalize
devaluate
devalue
devastate
develop
deviate
devil
devise
devitalize
devolve
devote
devour
diagnose
dial
dibble
dice
dicker
dictate
diddle
die
diet
differ
differentiate
diffract
diffuse
dig
digest
dignify
digress
dike
dilate
dilute
dim
diminish
dimple
din
dine
dip
direct
dirty
disable
disabuse
disagree
disallow
disappear
disappoint
disapprove
disarm
disarrange
disarray
disassociate
disavow
disband
disbelieve
disbud
disburden
disburse
discard
discern
discharge
discipline
disclaim
disclose
discolor
discolour
discomfit
discommode
discompose
disconcert
disconnect
discontent
discontinue
discount
discountenance
discourage
discourse
discover
discredit
discriminate
discuss
disdain
disembark
disembarrass
disembody
disembowel
disenchant
disencumber
disenfranchise
disengage
disentangle
disestablish
disfavor
disfavour
disfigure
disfranchise
disgorge
disgrace
disguise
disgust
dish
dishearten
dishonor
dishonour
disillusion
disincline
disinfect
disinfest
disinherit
disintegrate
disinter
disjoint
dislike
dislocate
dislodge
dismantle
dismay
dismember
dismiss
dismount
disobey
disoblige
disorder
disorganize
disorient
disorientate
disown
disparage
dispatch
dispel
dispense
disperse
dispirit
displace
display
displease
disport
dispose
dispossess
disprove
dispute
disqualify
disquiet
disregard
disrobe
disrupt
dissatisfy
dissect
dissemble
disseminate
dissent
dissever
dissimulate
dissipate
dissociate
dissolve
dissuade
distance
distend
distil
distinguish
distort
distract
distrain
distress
distribute
distrust
disturb
disunite
ditch
dither
divagate
dive
diverge
diversify
divert
divest
divide
divine
divorce
divulge
dizzy
dob
dock
docket
doctor
document
dodder
dodge
doff
dog
dogmatize
dole
doll
domesticate
dominate
domineer
don
donate
doodle
doom
dope
dose
doss
dot
dote
double
doubt
douse
dovetail
dower
down
downgrade
download
downplay
dowse
doze
draft
drag
dragoon
drain
dramatize
drape
drat
draw
drawl
dread
dream
dredge
drench
dress
dribble
drift
drill
drink
drip
drive
drivel
drizzle
drone
drool
droop
drop
drown
drowse
drub
drudge
drug
drum
dry
dub
duck
duel
duff
dull
dumbfound
dump
dun
dunk
dupe
duplicate
dust
dwarf
dwell
dwindle
dye
dyke
dynamite
earmark
earn
earth
ease
eat
eavesdrop
ebb
echo
eclipse
economize
eddy
edge
edify
edit
educate
educe
efface
effect
effervesce
egg
egotrip
ejaculate
eject
eke
elaborate
elapse
elate
elbow
elect
electrify
electrocute
electrogalvanize
electroplate
elevate
elicit
elide
eliminate
elongate
elope
elucidate
elude
emaciate
emanate
emancipate
emasculate
embalm
embargo
embark
embarrass
embed
embellish
embezzle
embitter
emblazon
embody
embolden
emboss
embrace
embroider
embroil
emend
emerge
emigrate
emit
empale
empanel
emphasize
emplane
employ
empower
empty
emulate
emulsify
enable
enact
enamel
encamp
encase
enchain
enchant
encircle
enclose
encode
encompass
encore
encounter
encourage
encroach
encrust
encumber
end
endanger
endorse
endow
endure
enervate
enfeeble
enfold
enforce
enfranchise
engage
engender
engineer
engraft
engrave
engross
engulf
enhance
enjoin
enjoy
enkindle
enlarge
enlighten
enlist
enliven
enmesh
ennoble
enplane
enquire
enrage
enrapture
enrich
enrol
enroll
ensconce
enshrine
enshroud
enslave
ensnare
ensue
ensure
entail
entangle
enter
entertain
enthral
enthrall
enthrone
enthuse
entice
entitle
entomb
entrain
entrap
entreat
entrench
entrust
entwine
enumerate
enunciate
envelop
envenom
envisage
envision
envy
enwrap
epitomize
equal
equalize
equip
eradicate
erase
erect
erode
err
erupt
escalate
escape
eschew
escort
espouse
espy
establish
esteem
estimate
estrange
etch
eulogize
evacuate
evade
evaluate
evaporate
even
evict
evidence
evince
eviscerate
evoke
evolve
exacerbate
exact
exaggerate
exalt
examine
exasperate
excavate
exceed
excel
except
exchange
excise
excite
exclude
excogitate
excommunicate
excoriate
excrete
exculpate
excuse
execrate
execute
exemplify
exempt
exercise
exert
exhale
exhaust
exhibit
exhilarate
exhort
exhume
exile
exist
exit
exonerate
exorcize
expand
expatriate
expect
expectorate
expedite
expel
expend
experience
experiment
expiate
expire
explain
explicate
explode
exploit
explore
export
expose
expostulate
expound
express
expropriate
expunge
expurgate
extemporize
extend
extenuate
exteriorize
exterminate
externalize
extinguish
extirpate
extol
extort
extract
extradite
extrapolate
extricate
extrude
exude
exult
eye
fabricate
face
facilitate
factor
factorize
fade
faff
fag
fail
faint
fake
fall
falsify
falter
familiarize
famish
fan
fancy
farm
farrow
fart
fascinate
fashion
fast
fasten
fate
father
fathom
fatigue
fatten
fault
favor
favour
fawn
fax
fear
feast
featherbed
feature
federate
fee
feed
feel
feign
feint
fell
fence
fend
ferment
ferret
fertilize
fess
fester
festoon
fetch
feud
fib
fiddle
fidget
field
fight
figure
filch
file
filibuster
fill
film
finalize
finance
find
fine
finger
finish
fink
fire
firm
fish
fit
fix
fixate
fizz
fizzle
flabbergast
flag
flagellate
flail
flake
flame
flank
flap
flare
flash
flatten
flatter
flaunt
flavor
flavour
flay
fleck
flee
fleece
flex
flick
flicker
flinch
flip
flirt
flit
float
flock
flog
flood
floodlight
floor
flop
flounce
flounder
flour
flourish
flout
flow
flower
fluctuate
fluff
flunk
fluoridate
fluoridize
flush
fluster
flute
flutter
fly
foam
fob
focus
fog
foil
foist
fold
follow
foment
fondle
fool
foot
footslog
forage
foray
forbid
force
ford
forearm
forebode
forecast
foreclose
foredoom
foregather
forego
foreknow
foreordain
foresee
foreshadow
foreshorten
forestall
foreswear
foretell
forewarn
forfeit
forgather
forge
forget
forgive
forgo
fork
form
formalize
formulate
fornicate
forsake
forswear
fortify
forward
fossilize
foster
foul
found
founder
fowl
fox
foxhunt
fracture
fragment
frame
franchise
frank
fraternize
fray
freak
freckle
free
freelance
freewheel
freeze
frequent
fresco
freshen
fret
fright
frighten
fringe
frisk
fritter
frizz
frizzle
frolic
front
frost
froth
frown
fructify
frustrate
fry
fuck
fuddle
fuel
fulfil
fulfill
fulminate
fumble
fume
fumigate
function
fund
furbish
furl
furnish
furrow
fuse
fuss
gabble
gad
gag
gain
gainsay
gall
gallivant
gallop
galvanize
gamble
gambol
game
gang
gangrene
gape
garage
garb
garble
garden
gargle
garland
garner
garnish
garotte
garrison
garrotte
gas
gash
gasify
gasp
gate
gatecrash
gather
gauge
gaze
gazette
gear
gee
geek
gel
geld
generalize
generate
genuflect
germinate
gerrymander
gesticulate
gesture
get
ghost
gibber
gibbet
gibe
gift
giggle
gild
gin
ginger
gird
girdle
give
gladden
glamorize
glance
glare
glass
glaze
gleam
glean
glide
glimmer
glimpse
glint
glissade
glisten
glister
glitter
gloat
globetrot
glom
glorify
glory
gloss
glow
glower
glue
glut
gnash
gnaw
go
goad
gobble
goggle
golf
gong
goof
gore
gorge
gormandize
gossip
gouge
govern
gown
grab
grace
grade
graduate
graft
grant
granulate
grapple
grasp
grass
grate
gratify
grave
gravel
gravitate
gray
graze
grease
greet
grey
grieve
grill
grimace
grime
grin
grind
grip
grit
grizzle
groan
groin
groom
groove
grope
gross
grouch
ground
group
grouse
grovel
grow
growl
grub
grudge
grumble
grunt
guarantee
guard
guess
guffaw
guide
guillotine
gull
gulp
gum
gun
gurgle
gush
gussy
gut
gutter
guy
guzzle
gyp
gyrate
habituate
hack
haggle
hail
halloo
hallow
halt
halve
ham
hammer
hamper
hamstring
hand
handcuff
handicap
handle
hang
hanker
happen
harangue
harass
harbor
harbour
harden
hark
harm
harmonize
harness
harp
harpoon
harry
harvest
hash
hassle
hasten
hatch
hate
haul
haunt
have
haw
hawk
hazard
haze
head
headquarter
heal
heap
hear
hearken
hearten
heat
heave
heckle
hedge
hedgehop
heed
heel
heighten
heliograph
help
hem
hemstitch
herald
herd
hesitate
hew
hibernate
hiccough
hiccup
hide
hie
highjack
highlight
hijack
hike
hinder
hinge
hint
hire
hiss
hit
hitch
hitchhike
hive
hoard
hoax
hobble
hobnob
hock
hoe
hog
hoist
hold
hole
holiday
holler
hollow
holystone
homogenize
hone
honeycomb
honeymoon
honk
honor
honour
hoodwink
hook
hoon
hoop
hoot
hoover
hop
hope
horrify
horsewhip
hose
hospitalize
host
hotfoot
hound
house
hover
howl
huddle
huff
hug
hull
hum
humanize
humble
humbug
humidify
humiliate
humor
humour
hump
hunch
hunger
hunker
hunt
hurdle
hurl
hurry
hurt
hurtle
husband
hush
husk
hustle
hybridize
hydrate
hyphen
hyphenate
hypnotize
hypothecate
ice
idealize
identify
idle
idolize
ignite
ignore
illuminate
illumine
illustrate
image
imagine
imbed
imbibe
imbue
imitate
immerse
immigrate
immobilize
immolate
immortalize
immunize
immure
impact
impair
impale
impanel
impart
impeach
impede
impel
impend
imperil
impersonate
impinge
implant
implement
implicate
implore
imply
import
importune
impose
impound
impoverish
imprecate
impregnate
impress
imprint
imprison
improve
improvise
impugn
impute
inactivate
inaugurate
incapacitate
incarcerate
incarnate
incense
inch
incinerate
incise
incite
incline
inclose
include
incommode
inconvenience
incorporate
increase
incriminate
incubate
inculcate
inculpate
incur
indemnify
indent
indenture
index
indicate
indict
indite
individualize
indoctrinate
indorse
induce
induct
indue
indulge
industrialize
inebriate
infatuate
infect
infer
infest
infiltrate
inflame
inflate
inflect
inflict
influence
inform
infringe
infuriate
infuse
ingest
ingraft
ingratiate
inhabit
inhale
inherit
inhibit
initial
initiate
inject
injure
ink
inlay
innovate
inoculate
inquire
inscribe
inseminate
insert
inset
insinuate
insist
inspect
inspire
install
instance
instigate
instil
institute
institutionalize
instruct
insulate
insult
insure
integrate
intend
intensify
inter
interbreed
intercede
intercept
interchange
intercommunicate
interconnect
interdict
interest
interfere
interject
interlace
interlard
interleave
interlink
interlock
intermarry
intermingle
intermix
intern
internalize
internationalize
interpellate
interpolate
interpose
interpret
interrelate
interrogate
interrupt
intersect
intersperse
intertwine
intervene
interview
interweave
intimate
intimidate
intone
intoxicate
intrench
intrigue
introduce
introspect
introvert
intrude
intuit
inundate
inure
invade
invalid
invalidate
inveigh
inveigle
invent
invert
invest
investigate
invigorate
invite
invoice
invoke
involve
ionize
irk
iron
irradiate
irrigate
irritate
isolate
issue
italicize
itch
itemize
iterate
jab
jabber
jack
jag
jail
jam
jampack
jangle
japan
jar
jaundice
jaunt
jaw
jaywalk
jazz
jeer
jell
jelly
jeopardize
jerk
jest
jettison
jewel
jib
jibe
jig
jiggle
jilt
jingle
jive
job
jockey
jog
joggle
join
joint
joke
jolly
jolt
jostle
jot
journey
joust
judder
judge
jug
juggle
jumble
jump
junket
justify
juxtapose
keel
keen
keep
kennel
key
kick
kid
kidnap
kill
kindle
kink
kip
kiss
kit
knead
kneel
knife
knight
knit
knock
knot
know
knuckle
kotow
kowtow
label
labor
labour
lace
lacerate
lack
lacquer
ladder
lade
ladle
lag
laicize
lam
lamb
lambaste
lame
lament
laminate
lampoon
lance
land
landscape
languish
lap
lapse
lard
lark
lash
lasso
last
latch
lather
laud
laugh
launch
launder
lave
lay
layer
laze
lead
leaf
leak
lean
leap
leapfrog
learn
lease
leave
leaven
lecture
leer
legalize
legislate
legitimatize
lend
lengthen
lessen
let
levant
level
lever
levitate
levy
libel
liberalize
liberate
licence
license
lick
lie
lift
light
lighten
like
lilt
lime
limit
limn
limp
line
linger
link
lionize
liquefy
liquidate
liquidize
lisp
list
listen
lithograph
litigate
litter
live
liven
load
loaf
loan
loathe
lob
lobby
localize
locate
lock
lodge
loft
log
loiter
look
loom
loop
loose
loosen
loot
lop
lope
lose
lounge
lour
love
low
lower
lubricate
luck
luff
lug
lull
lumber
lump
lunch
lunge
lurch
lure
lynch
macadamize
macerate
machine
madden
maffick
magnetize
magnify
mail
maim
maintain
major
make
malfunction
malign
malinger
malt
maltreat
man
manacle
manage
mandate
maneuver
mangle
manhandle
manicure
manifest
manifold
manipulate
manoeuvre
mantle
manufacture
manumit
manure
map
mar
maraud
march
marinade
marinate
mark
market
maroon
marry
marshal
martyr
marvel
mash
mask
masquerade
mass
massacre
massage
master
mastermind
masticate
masturbate
mat
match
mate
materialize
matriculate
matter
maturate
mature
maul
maunder
max
maximise
maximize
mean
meander
measure
mechanize
meddle
mediate
medicate
meditate
meet
meld
meliorate
mellow
melt
memorialize
memorize
menace
mend
menstruate
mention
merge
merit
mesh
mesmerize
mess
metal
metamorphose
mete
metricize
mew
miaou
miaow
microfilm
migrate
mildew
militate
milk
mill
mime
mimeograph
mimic
mince
mind
mine
mingle
miniaturize
minimize
minister
mint
minute
mire
mirror
misadvise
misapply
misapprehend
misappropriate
misbehave
miscalculate
miscall
miscarry
miscast
misconceive
misconduct
misconstrue
miscount
misdate
misdeal
misdirect
misfire
misgovern
misguide
mishandle
misinform
misinterpret
misjudge
mislay
mislead
mismanage
misname
misplace
misprint
mispronounce
misquote
misread
misrepresent
miss
misspell
misspend
misstate
mist
mistake
mistime
mistranslate
mistrust
misunderstand
misuse
mitigate
mix
mizzle
moan
mob
mobilize
mock
model
moderate
modernize
modify
modulate
moggy
moil
moisten
mold
molder
molest
mollify
mollycoddle
molt
monetize
monitor
monkey
monopolize
moo
mooch
moon
moor
mop
mope
moralize
mortar
mortgage
mortice
mortify
mortise
mosey
mother
mothproof
motivate
motor
motorize
mottle
mould
moulder
moult
mount
mourn
mouse
mouth
move
mow
muck
mud
muddle
muddy
muff
muffle
mug
mulch
mull
multiply
mumble
mummify
munch
munition
murder
murmur
muscle
muse
mushroom
muss
muster
mute
mutilate
mutiny
mutter
muzzle
mystify
nab
naff
nag
nail
name
nap
narrate
narrow
nasalize
nationalize
naturalize
nauseate
navigate
near
necessitate
neck
need
needle
negate
neglect
negotiate
neigh
neighbor
neighbour
nerd
nest
net
neuter
neutralize
nibble
nick
nickel
nickname
nip
nod
nominate
nonplus
noose
normalize
nose
nosedive
nosh
notch
note
notice
notify
nourish
nudge
nullify
numb
number
nurse
nurture
nuzzle
obey
obfuscate
object
oblige
obliterate
obscure
observe
obsess
obstruct
obtain
obtrude
obviate
occasion
occupy
occur
offend
offer
officiate
offset
ogle
oil
okay
omen
omit
ooze
open
operate
oppose
oppress
opt
orate
orbit
orchestrate
ordain
order
organize
orientate
originate
ornament
orphan
oscillate
ossify
ostracize
oust
outbid
outbrave
outclass
outdistance
outdo
outface
outfight
outfit
outflank
outfox
outgrow
outlast
outlaw
outline
outlive
outmaneuver
outmanoeuvre
outmarch
outmatch
outnumber
outpace
outperform
outplay
outpoint
outrage
outrange
outrank
outride
outrun
outsail
outshine
outsmart
outstay
outstrip
outvie
outvote
outwear
outweigh
outwit
overact
overarch
overawe
overbalance
overbear
overbid
overbuild
overburden
overbuy
overcharge
overclothe
overcloud
overcome
overcook
overcrop
overcrowd
overdo
overdraw
overdress
overeat
overemphasize
overestimate
overexert
overexpose
overfeed
overflow
overfly
overhang
overhaul
overhear
overheat
overindulge
overlap
overlay
overleap
overlie
overload
overlook
overmaster
overpay
overplay
overpower
overpraise
overprint
overproduce
overrate
overreach
overreact
override
overrule
overrun
oversee
overshadow
overshoot
oversimplify
oversleep
overspend
overstate
overstay
overstep
overstock
overstrain
overtake
overtax
overthrow
overtop
overtrump
overturn
overvalue
overwhelm
overwork
owe
own
oxidize
oxygenate
oxygenize
pace
pacify
pack
package
pad
paddle
padlock
page
pain
paint
pair
palaver
pale
pall
palliate
palm
palpitate
palsy
palter
pamper
pan
panel
panhandle
panic
pant
paper
parade
parallel
paralyse
paralyze
paraphrase
parboil
parcel
parch
pardon
pare
park
parley
parody
parole
parry
parse
part
partake
participate
particularize
partition
partner
pass
paste
pasteurize
pasture
pat
patch
patent
patrol
patronize
patter
pattern
pauperize
pause
pave
paw
pawn
pay
peak
peal
pearl
peck
peculate
pedal
peddle
pee
peek
peel
peep
peeve
peg
pelletize
pelt
pen
penalize
penetrate
pension
people
pep
pepper
perambulate
perceive
perch
percolate
perfect
perforate
perform
perfume
peril
perish
perjure
perm
permeate
permit
permute
perpetrate
perpetuate
perplex
persecute
persevere
persist
personalize
personate
personify
perspire
persuade
perturb
peruse
pervade
pervert
pester
pestle
pet
peter
petition
petrify
phase
philander
philosophize
phone
photocopy
photograph
photosensitize
photostat
phrase
pick
picket
pickle
picnic
picture
piddle
piece
pierce
piffle
pig
pigeonhole
pilfer
pillage
pillow
pilot
pimp
pinch
ping
pinion
pinnacle
pinpoint
pioneer
pip
pique
pirate
pirouette
piss
pit
pitch
pity
pivot
placard
placate
place
plagiarize
plague
plait
plan
plane
plank
plant
plash
plaster
plate
play
pleach
plead
please
pleat
pledge
plight
plod
plonk
plot
plough
plow
pluck
plug
plumb
plume
plummet
plump
plunder
plunge
ply
poach
pocket
pod
point
poise
poison
poke
polarize
poleaxe
police
polish
politicize
politick
poll
pollard
pollinate
pollute
pomade
pommel
ponder
poniard
pontificate
pool
pootle
pop
popularize
populate
port
portend
portion
portray
pose
posit
position
possess
post
postdate
postmark
postpone
postulate
posture
pot
potter
pouch
pounce
pound
pour
pout
powder
power
powwow
practice
practise
praise
prance
prate
prattle
prawn
pray
preach
preachify
prearrange
precede
precipitate
preclude
precoat
preconceive
predecease
predestinate
predestine
predetermine
predicate
predict
predigest
predominate
preen
prefabricate
preface
prefer
prefigure
prefix
prefloat
preheat
prejudge
prejudice
prelude
premeditate
premise
preoccupy
preordain
prepare
prepay
prepossess
prerecord
presage
prescribe
present
preserve
preside
press
pressure
presume
presuppose
pretend
prettify
prevail
prevaricate
prevent
preview
prey
price
prick
prickle
prim
prime
primp
prink
print
privatize
prize
probate
probe
proceed
process
proclaim
procrastinate
procreate
procure
prod
produce
profane
profess
proffer
profile
profit
profiteer
prognosticate
program
programme
progress
prohibit
project
proliferate
prolong
promenade
promise
promote
prompt
promulgate
pronounce
proof
proofread
propagandize
propagate
propel
prophesy
propitiate
proportion
propose
proposition
propound
prorogue
proscribe
prosecute
proselytize
prospect
prosper
prostitute
prostrate
protect
protest
protract
protrude
prove
provide
provision
provoke
prowl
prune
pry
psych
psychoanalyse
psychoanalyze
publicize
publish
pucker
puddle
puke
pull
pullulate
pulp
pulsate
pulse
pulverize
pummel
pump
pun
punch
punctuate
puncture
punish
punt
purchase
purge
purify
purloin
purport
purr
purse
pursue
purvey
push
putrefy
putt
putter
putty
puzzle
quack
quadruple
quadruplicate
quaff
quail
quake
qualify
quantify
quarantine
quarrel
quarry
quarter
quash
quaver
queen
quell
quench
query
question
queue
quibble
quicken
quiet
quieten
quilt
quit
quiver
quiz
quote
rabbit
race
rack
racket
radiate
raffle
raft
rag
rage
raid
rail
railroad
rain
raise
rake
rally
ram
ramble
ramify
ramp
rampage
range
rank
rankle
ransack
ransom
rant
rap
rape
rarefy
rasp
rat
rate
ratify
ration
rationalize
rattle
ravage
rave
ravel
ravish
ray
raze
reach
react
reactivate
read
readjust
readmit
reaffirm
realign
realize
reanimate
reap
reappear
rear
rearm
rearrange
reason
reassemble
reassert
reassess
reassign
reassure
reattribute
rebel
rebind
rebody
rebound
rebuff
rebuild
rebuke
rebut
recall
recant
recap
recapitalize
recapitulate
recapture
recast
recede
receipt
receive
recess
reciprocate
recite
reckon
reclaim
recline
recognize
recoil
recollect
recombine
recommend
recommit
recompense
reconcile
recondition
reconnoiter
reconnoitre
reconsecrate
reconsider
reconstruct
reconvict
record
recount
recoup
recover
recreate
recriminate
recruit
rectify
recuperate
recur
recurve
recycle
redact
redden
redecorate
redeem
redefine
redeploy
redesign
redevelop
rediscover
redistribute
redo
redouble
redound
redraw
redress
reduce
reduplicate
reef
reek
reel
reelect
reemploy
reexamine
reface
refashion
referee
refill
refinance
refine
refit
reflate
reflect
refloat
refocus
reforest
reform
refract
refrain
refresh
refrigerate
refuel
refund
refurbish
refurnish
refuse
refute
regain
regale
regard
regenerate
regiment
register
regress
regret
regroup
regularize
regulate
regurgitate
rehabilitate
rehash
rehear
rehearse
rehouse
reign
reimburse
rein
reincarnate
reinforce
reinstate
reinsure
reintegrate
reinterpret
reintroduce
reinvest
reissue
reiterate
reject
rejoice
rejoin
rejuvenate
rekindle
relapse
relate
relax
relay
release
relegate
relent
relieve
reline
relinquish
relish
relive
relocate
rely
remain
remake
remand
remark
remarry
remedy
remember
remilitarize
remind
reminisce
remit
remodel
remodify
remold
remonstrate
remould
remount
remove
remunerate
rename
rend
render
rendezvous
renege
renegotiate
renew
renounce
renovate
rent
reoffer
reopen
reorganize
reorient
reorientate
repackage
repaint
repair
repatriate
repay
repeal
repeat
repel
repent
repine
replace
replant
replay
replenish
reply
repoint
report
repose
repot
reprehend
represent
repress
reprieve
reprimand
reprint
reproach
reprobate
reprocess
reproduce
reprogram
reprove
repudiate
repulse
repurchase
repute
request
require
requisition
requite
reread
rerun
reschedule
rescind
rescue
research
reseat
reseed
resell
resemble
resent
reserve
reset
resettle
reshape
reshuffle
reside
resign
resist
resole
resolve
resonate
resort
resound
respect
respire
respond
rest
restart
restate
restitute
restock
restore
restrain
restrict
restructure
restyle
result
resume
resupply
resurface
resurrect
resuscitate
ret
retail
retain
retake
retaliate
retard
retch
retell
rethink
reticulate
retire
retool
retort
retouch
retrace
retract
retrain
retransmit
retread
retreat
retrench
retrieve
retrograde
retrogress
return
reunite
rev
revalue
revamp
reveal
revel
revenge
reverberate
revere
reverence
reverse
revert
review
revile
revise
revisit
revitalize
revive
revivify
revoke
revolt
revolutionize
revolve
reward
rewire
reword
rewrite
rhapsodize
rhyme
rib
rick
ricochet
rid
riddle
ride
ridge
ridicule
riffle
rifle
rig
right
rile
rim
ring
rinse
riot
rip
ripen
riposte
ripple
rise
risk
rival
rive
rivet
roam
roar
roast
rob
rock
rocket
roil
roll
romance
romanticize
romp
roof
rook
room
roost
root
rootle
rope
rosin
rot
rotate
rouge
rough
roughcast
roughen
round
rouse
rout
route
rove
row
rub
rubberize
rubberneck
ruck
ruddle
rue
ruff
ruffle
ruin
rule
rumble
ruminate
rummage
rumor
rumour
rumple
run
rupture
rush
rust
rusticate
rustle
rut
saber
sabotage
sabre
sack
sacrifice
sadden
saddle
safeguard
sag
sail
salivate
sallow
sally
salt
salute
salvage
salve
sample
sanctify
sanction
sand
sandblast
sandpaper
sandwich
sap
sate
satiate
satirize
satisfy
saturate
sauce
savage
save
savor
savour
savvy
saw
say
scald
scale
scallop
scalp
scamper
scan
scandalize
scant
scar
scare
scarify
scatter
scavenge
scent
schedule
scheme
school
scintillate
scoff
scold
scollop
scoop
scoot
scorch
score
scorn
scotch
scour
scourge
scout
scowl
scrabble
scrag
scram
scramble
scrap
scrape
scratch
scrawl
scream
screech
screen
scribble
scrimmage
scrimp
scrounge
scrub
scrutinize
scud
scuff
scuffle
scull
sculpt
sculpture
scupper
scurry
scuttle
scuzz
seal
seam
sear
search
season
seat
secede
seclude
second
secrete
secularize
secure
sedate
seduce
see
seed
seek
seep
seesaw
seethe
segment
segregate
seine
seize
select
sell
send
sense
sensitize
sentence
sentimentalize
separate
sequester
sequestrate
serenade
serialize
sermonize
serve
service
set
settle
sever
sew
sex
shack
shackle
shade
shadow
shag
shake
shallow
sham
shamble
shame
shampoo
shanghai
shape
share
sharpen
shatter
shave
shear
sheathe
shed
shell
shellac
shelter
shelve
shepherd
shield
shift
shillyshally
shimmer
shin
shine
shingle
ship
shipwreck
shirk
shit
shiver
shoal
shock
shoe
shoo
shoot
shop
shoplift
shore
short
shorten
shortlist
shoulder
shout
shove
shovel
show
shower
shred
shriek
shrill
shrimp
shrine
shrink
shrive
shrivel
shroud
shrug
shuck
shudder
shuffle
shun
shunt
shush
shut
shutter
shuttle
shy
sicken
side
sidestep
sidetrack
sidle
sieve
sift
sigh
sight
sign
signal
signalize
signify
signpost
silence
silhouette
silt
silver
simmer
simper
simplify
simulate
sin
sing
singe
singularize
sink
sip
sire
sit
site
situate
size
sizzle
skate
sketch
skew
skewer
skid
skim
skimp
skin
skip
skipper
skirmish
skirt
skitter
skittle
skive
skulk
skyrocket
slack
slacken
slag
slake
slam
slander
slang
slant
slap
slash
slate
slaughter
slave
slaver
slay
sledge
sleek
sleep
sleet
sleigh
slenderize
slew
slice
slide
slight
sling
slink
slip
slit
slither
sliver
slobber
slog
slop
slope
slosh
slot
slouch
slough
slow
slue
slug
sluice
slum
slumber
slump
slur
smack
smart
smarten
smash
smear
smell
smelt
smile
smirch
smirk
smite
smoke
smolder
smooth
smother
smoulder
smudge
smuggle
smut
snaffle
snag
snap
snare
snarl
snatch
sneak
sneer
sneeze
snick
snicker
sniff
sniffle
snigger
snip
snipe
snitch
snivel
snooze
snore
snort
snow
snowball
snowmobile
snub
snuff
snuffle
snuggle
soak
soap
soar
sob
sober
socialize
sock
sod
soften
soil
sojourn
solace
solder
soldier
sole
solemnize
solicit
solidify
soliloquize
solve
somersault
soot
soothe
sop
sorrow
sort
sough
sound
soundproof
soup
sour
souse
sovietize
sow
space
spade
spaff
span
spangle
spank
spar
spare
spark
sparkle
spat
spatter
spawn
spay
speak
spear
spearhead
specialize
specify
speechify
speed
spell
spend
spew
spice
spiel
spiff
spike
spill
spin
spiral
spiritualize
spirt
spit
spite
splash
splay
splice
splinter
split
splosh
splurge
splutter
spoil
sponge
sponsor
spoof
spook
spoonfeed
sport
spot
spotlight
spout
sprain
sprawl
spray
spread
spreadeagle
spring
sprinkle
sprint
sprout
spue
spur
spurn
spurt
sputter
spy
squabble
squall
squander
square
squash
squat
squawk
squeak
squeal
squeegee
squeeze
squelch
squint
squire
squirm
squirt
stab
stabilize
stable
stack
staff
stage
stagger
stagnate
stain
stake
stale
stalemate
stalk
stall
stammer
stamp
stampede
stanch
stand
standardize
staple
star
starboard
starch
stare
start
startle
starve
stash
state
staunch
stay
steady
steal
steam
steamroller
steel
steep
steepen
steer
stem
stencil
step
stereotype
sterilize
stew
stick
stiffen
stifle
stigmatize
still
stimulate
sting
stink
stint
stipple
stipulate
stir
stock
stockade
stoke
stomach
stomp
stone
stonewall
stoop
stop
store
storm
stow
straddle
strafe
straighten
strain
straiten
strand
strangle
strap
stratify
straw
stray
streak
streamline
strengthen
stress
stretch
strew
stridulate
strike
strip
stroke
strop
structure
struggle
strum
stub
stucco
stud
study
stuff
stultify
stump
stun
stunt
stupefy
stupify
stutter
style
stylize
stymie
sub
subdivide
subdue
subedit
subjoin
subjugate
sublease
sublet
sublimate
submerge
submit
suborn
subpoena
subscribe
subserve
subside
subsidize
substantiate
substitute
subsume
subtend
subtract
subvert
succeed
succor
succour
succumb
suck
suckle
sue
suffer
suffice
suffocate
suffuse
sugar
suggest
suit
sulk
sully
sum
summarize
summon
summons
sun
sunbathe
sunder
sup
superannuate
superimpose
superintend
supersede
supervene
supervise
supplant
supplement
supplicate
supply
support
suppose
suppress
suppurate
surcharge
surface
surfeit
surge
surmise
surmount
surpass
surprise
surrender
surround
surtax
survey
survive
suspect
suspend
suss
sustain
swab
swaddle
swagger
swallow
swamp
swan
swank
swap
swarm
swat
swathe
sway
swear
sweat
sweep
sweeten
swell
swelter
swerve
swig
swill
swim
swindle
swing
swinge
swipe
swirl
swish
switch
swivel
swoon
swoop
swop
swot
syllabicate
syllabify
syllabize
symbolize
sympathize
synchronize
syncopate
syndicate
synthesize
syphon
syringe
systematize
table
tabulate
tackle
tag
tail
tailor
taint
take
talk
tally
tame
tamp
tan
tangle
tantalize
tap
tape
taper
tar
target
tarnish
tarry
taste
tattle
tattoo
taunt
tax
teach
tear
tease
teem
teeter
teethe
telecast
teleconference
telegraph
telephone
telescope
televise
tell
temper
temporize
tempt
tenant
tend
tender
tense
terminate
terrify
terrorize
test
testify
tether
thank
thatch
thaw
thicken
thieve
thin
think
thirst
thrash
thread
threaten
thrill
thrive
throb
throng
throttle
throw
thrum
thud
thumb
thump
thwack
thwart
ticket
tickle
tidy
tie
tighten
tile
till
tilt
time
ting
tinge
tingle
tinkle
tinsel
tint
tip
tipple
tire
titillate
titter
toady
toast
toboggan
toddle
toe
toil
tolerate
toll
tone
tool
toot
tootle
top
topple
torment
torpedo
torture
toss
tot
total
tote
totter
touch
toughen
tour
tousle
tow
trace
track
trade
traduce
traffic
trail
train
trammel
tramp
trample
tranquilize
tranquillize
transact
transcend
transcribe
transfer
transfigure
transfix
transform
transfuse
transgress
translate
transliterate
transmit
transmogrify
transmute
transpire
transplant
transport
transpose
trap
travel
traverse
tread
treasure
treat
treble
trellis
tremble
trench
trepan
trephine
trespass
trice
trick
trickle
trigger
trill
trim
trip
triple
trisect
triumph
trivialize
troll
trouble
trounce
true
trump
trumpet
truncate
trundle
truss
trust
try
tug
tumble
tune
turf
turn
tussle
tutor
twang
tweak
tweet
twiddle
twig
twin
twine
twinkle
twirl
twist
twit
twitch
twitter
type
typecast
typify
tyrannize
uglify
ulcerate
ululate
umpire
unbalance
unbar
unbend
unbind
unblock
unbolt
unbosom
unbuckle
unburden
unbutton
unchain
uncork
uncouple
uncover
uncross
uncurl
undeceive
underact
underbid
undercharge
undercut
underestimate
underexpose
undergo
underlie
underline
undermine
underpay
underpin
underquote
underrate
underscore
undersell
undershoot
undersign
underspend
understand
understate
understock
understudy
undertake
undervalue
underwrite
undo
undock
undress
undulate
unearth
unfasten
unfit
unfold
unfrock
unfurl
unhand
unhinge
unhitch
unhook
unhorse
unify
unionize
unite
unlace
unlearn
unleash
unload
unlock
unloose
unman
unmask
unnerve
unpack
unpick
unplug
unravel
unroll
unsaddle
unscramble
unscrew
unseat
unsettle
unsex
unsheathe
untie
unveil
unwind
unwrap
unzip
up
upbraid
update
upgrade
uphold
upholster
uplift
upload
uproot
upset
upstage
urbanize
urge
urinate
use
usher
usurp
utilize
utter
vacate
vacation
vaccinate
vacillate
valet
validate
value
vamoose
vamp
vanish
vanquish
vaporize
varnish
vary
vault
vaunt
veg
vegetate
veil
vend
venerate
vent
ventilate
verbalize
verify
vet
veto
vex
vibrate
victimize
videotape
view
vilify
vindicate
violate
visit
visualize
vitalize
vitiate
vitrify
vituperate
vivisect
vocalize
vociferate
voice
void
volley
volunteer
vomit
vote
vouch
vouchsafe
vow
vulcanize
vulgarize
wad
waddle
wade
wag
wage
wager
waggle
wail
wait
waive
wake
waken
walk
wallop
wallow
waltz
wander
wane
wangle
want
war
warble
ward
warm
warn
warp
warrant
wash
waste
watch
water
waterproof
wave
waver
wax
waylay
weaken
wean
wear
weary
weather
weave
wed
weed
weep
weigh
welcome
weld
well
westernize
wet
whack
whale
wheedle
wheel
wheeze
whelp
whet
whimper
whinny
whip
whir
whirl
whirr
whisk
whisper
whistle
whiten
whitewash
whittle
whizz
whoop
widen
wield
wiggle
will
wilt
win
wince
wind
wine
wing
wink
winnow
wipe
wire
wiretap
wish
withdraw
wither
withhold
withstand
witness
wobble
wolf
womanize
wonder
woo
word
work
worry
worsen
worship
wound
wrangle
wrap
wreak
wreck
wrench
wrest
wrestle
wriggle
wring
wrinkle
write
writhe
wrong
yack
yammer
yank
yawn
yell
yellow
yelp
yield
yodel
yoke
zap
zero
zip
zone
zonk